<a href="https://colab.research.google.com/github/kunal24bit/Data-Pre-processing/blob/main/file_manipulation_in_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
 
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')   
titanic_train

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
151          152         1       1  ...  66.6000    C2         S
152          153         0       3  ...   8.0500   NaN         S
153          154         0       3  ...  14.5000   NaN         S
154          155         0       3  ...   7.3125   NaN         S
155          156         0       1  ...  61.3792   NaN         C

[156 rows x 12 columns]

In [3]:
titanic_train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [4]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
titanic_train["Age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
151    22.0
152    55.5
153    40.5
154     NaN
155    51.0
Name: Age, Length: 156, dtype: float64

In [7]:
type(titanic_train["Age"])

pandas.core.series.Series

In [8]:
titanic_train[["Age"]]

      Age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
151  22.0
152  55.5
153  40.5
154   NaN
155  51.0

[156 rows x 1 columns]

In [9]:
type(titanic_train[["Age"]])

pandas.core.frame.DataFrame

In [10]:
## printing the data in reverse way

titanic_train['Age'][::-1]

155    51.0
154     NaN
153    40.5
152    55.5
151    22.0
       ...
4      35.0
3      35.0
2      26.0
1      38.0
0      22.0
Name: Age, Length: 156, dtype: float64

In [11]:
#Series does not support the negative indices
titanic_train["Age"][-1]

KeyError: ignored

In [12]:
titanic_train["Age"][::2]

0      22.0
2      26.0
4      35.0
6      54.0
8      27.0
       ...
146    27.0
148    36.5
150    51.0
152    55.5
154     NaN
Name: Age, Length: 78, dtype: float64

In [13]:
titanic_train.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   156.000000  156.000000  156.000000  ...  156.000000  156.000000  156.000000
mean     78.500000    0.346154    2.423077  ...    0.615385    0.397436   28.109587
std      45.177428    0.477275    0.795459  ...    1.056235    0.870146   39.401047
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    6.750000
25%      39.750000    0.000000    2.000000  ...    0.000000    0.000000    8.003150
50%      78.500000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     117.250000    1.000000    3.000000  ...    1.000000    0.000000   30.371850
max     156.000000    1.000000    3.000000  ...    5.000000    5.000000  263.000000

[8 rows x 7 columns]

#Age has missing values

In [14]:
titanic_train.describe(include = "all")

        PassengerId    Survived      Pclass  ...        Fare Cabin  Embarked
count    156.000000  156.000000  156.000000  ...  156.000000    31       155
unique          NaN         NaN         NaN  ...         NaN    28         3
top             NaN         NaN         NaN  ...         NaN   D26         S
freq            NaN         NaN         NaN  ...         NaN     2       110
mean      78.500000    0.346154    2.423077  ...   28.109587   NaN       NaN
std       45.177428    0.477275    0.795459  ...   39.401047   NaN       NaN
min        1.000000    0.000000    1.000000  ...    6.750000   NaN       NaN
25%       39.750000    0.000000    2.000000  ...    8.003150   NaN       NaN
50%       78.500000    0.000000    3.000000  ...   14.454200   NaN       NaN
75%      117.250000    1.000000    3.000000  ...   30.371850   NaN       NaN
max      156.000000    1.000000    3.000000  ...  263.000000   NaN       NaN

[11 rows x 12 columns]

In [15]:
titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [16]:
titanic_train_cat = titanic_train[titanic_train.dtypes[titanic_train.dtypes == "object"].index]

In [17]:
titanic_train_cat.describe()

                           Name   Sex Ticket Cabin Embarked
count                       156   156    156    31      155
unique                      156     2    145    28        3
top     Carrau, Mr. Francisco M  male  35281   D26        S
freq                          1   100      2     2      110

In [18]:
titanic_train[["Age"]]

      Age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
151  22.0
152  55.5
153  40.5
154   NaN
155  51.0

[156 rows x 1 columns]

In [19]:
import numpy as np

titanic_train_age_null = np.where(titanic_train["Age"].isnull() == True)

In [20]:
titanic_train[titanic_train["Age"].isnull() == True]

     PassengerId  Survived  Pclass  ...      Fare  Cabin  Embarked
5              6         0       3  ...    8.4583    NaN         Q
17            18         1       2  ...   13.0000    NaN         S
19            20         1       3  ...    7.2250    NaN         C
26            27         0       3  ...    7.2250    NaN         C
28            29         1       3  ...    7.8792    NaN         Q
29            30         0       3  ...    7.8958    NaN         S
31            32         1       1  ...  146.5208    B78         C
32            33         1       3  ...    7.7500    NaN         Q
36            37         1       3  ...    7.2292    NaN         C
42            43         0       3  ...    7.8958    NaN         C
45            46         0       3  ...    8.0500    NaN         S
46            47         0       3  ...   15.5000    NaN         Q
47            48         1       3  ...    7.7500    NaN         Q
48            49         0       3  ...   21.6792    NaN         C
55            56         1       1  ...   35.5000    C52         S
64            65         0       1  ...   27.7208    NaN         C
65            66         1       3  ...   15.2458    NaN         C
76            77         0       3  ...    7.8958    NaN         S
77            78         0       3  ...    8.0500    NaN         S
82            83         1       3  ...    7.7875    NaN         Q
87            88         0       3  ...    8.0500    NaN         S
95            96         0       3  ...    8.0500    NaN         S
101          102         0       3  ...    7.8958    NaN         S
107          108         1       3  ...    7.7750    NaN         S
109          110         1       3  ...   24.1500    NaN         Q
121          122         0       3  ...    8.0500    NaN         S
126          127         0       3  ...    7.7500    NaN         Q
128          129         1       3  ...   22.3583  F E69         C
140          141         0       3  ...   15.2458    NaN         C
154          155         0       3  ...    7.3125    NaN         S

[30 rows x 12 columns]

In [21]:
titanic_train_age_null

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154]),)

In [22]:
titanic_train.iloc[titanic_train_age_null]

     PassengerId  Survived  Pclass  ...      Fare  Cabin  Embarked
5              6         0       3  ...    8.4583    NaN         Q
17            18         1       2  ...   13.0000    NaN         S
19            20         1       3  ...    7.2250    NaN         C
26            27         0       3  ...    7.2250    NaN         C
28            29         1       3  ...    7.8792    NaN         Q
29            30         0       3  ...    7.8958    NaN         S
31            32         1       1  ...  146.5208    B78         C
32            33         1       3  ...    7.7500    NaN         Q
36            37         1       3  ...    7.2292    NaN         C
42            43         0       3  ...    7.8958    NaN         C
45            46         0       3  ...    8.0500    NaN         S
46            47         0       3  ...   15.5000    NaN         Q
47            48         1       3  ...    7.7500    NaN         Q
48            49         0       3  ...   21.6792    NaN         C
55            56         1       1  ...   35.5000    C52         S
64            65         0       1  ...   27.7208    NaN         C
65            66         1       3  ...   15.2458    NaN         C
76            77         0       3  ...    7.8958    NaN         S
77            78         0       3  ...    8.0500    NaN         S
82            83         1       3  ...    7.7875    NaN         Q
87            88         0       3  ...    8.0500    NaN         S
95            96         0       3  ...    8.0500    NaN         S
101          102         0       3  ...    7.8958    NaN         S
107          108         1       3  ...    7.7750    NaN         S
109          110         1       3  ...   24.1500    NaN         Q
121          122         0       3  ...    8.0500    NaN         S
126          127         0       3  ...    7.7500    NaN         Q
128          129         1       3  ...   22.3583  F E69         C
140          141         0       3  ...   15.2458    NaN         C
154          155         0       3  ...    7.3125    NaN         S

[30 rows x 12 columns]

In [23]:
titanic_train.iloc[5]
#gives series all the time

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                         NaN
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [24]:
type(titanic_train.iloc[5])

pandas.core.series.Series

In [25]:
titanic_train.iloc[[1,2,3,5,6,7]]

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S

[6 rows x 12 columns]

In [27]:
titanic_train[["Fare"]] == titanic_train["Fare"].max()

      Fare
0    False
1    False
2    False
3    False
4    False
..     ...
151  False
152  False
153  False
154  False
155  False

[156 rows x 1 columns]

In [28]:
titanic_train[["Age", "Cabin"]][titanic_train["Cabin"].isnull() ==  True]

      Age Cabin
0    22.0   NaN
2    26.0   NaN
4    35.0   NaN
5     NaN   NaN
7     2.0   NaN
..    ...   ...
150  51.0   NaN
152  55.5   NaN
153  40.5   NaN
154   NaN   NaN
155  51.0   NaN

[125 rows x 2 columns]

In [29]:
titanic_train[["Age", 'Cabin']][titanic_train["Cabin"] == 'NaN']

Empty DataFrame
Columns: [Age, Cabin]
Index: []

In [30]:
#how manyy male passenger survived?

(titanic_train["Sex"] == "Male") & (titanic_train["Survived"] == 1)

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154    False
155    False
Length: 156, dtype: bool

In [31]:
d = {"key" : "kunal", "title" : "Verma", "mail_id": "vermakunal"}

In [32]:
pd.DataFrame(d, index = ["key", "title", "mail_id"])

           key  title     mail_id
key      kunal  Verma  vermakunal
title    kunal  Verma  vermakunal
mail_id  kunal  Verma  vermakunal

In [33]:
ser  = pd.Series(np.array([1,2,3,4,5]), index = ["a", "b", 2, "kunal", 5])

In [34]:
ser

a        1
b        2
2        3
kunal    4
5        5
dtype: int64

In [35]:
ser.loc["kunal"]

4

In [36]:
ser.iloc[2]

3

In [37]:
df = pd.DataFrame(np.random.randint(3,6,(4,5)),index = ['a','b','c','d'], columns=['x','y','z','u','v'])

In [38]:
df

   x  y  z  u  v
a  4  3  5  5  3
b  5  3  5  4  3
c  3  5  5  5  5
d  4  3  4  5  5

In [39]:
df.iloc[[2,3],[2,3]]

   z  u
c  5  5
d  4  5

In [40]:
df.loc[[c:d],[z:u]]

SyntaxError: ignored

In [41]:
df["new"] = df["x"] + df.y

In [42]:
df

   x  y  z  u  v  new
a  4  3  5  5  3    7
b  5  3  5  4  3    8
c  3  5  5  5  5    8
d  4  3  4  5  5    7

In [43]:
df.drop('x', axis =1)

   y  z  u  v  new
a  3  5  5  3    7
b  3  5  4  3    8
c  5  5  5  5    8
d  3  4  5  5    7

In [44]:
df

   x  y  z  u  v  new
a  4  3  5  5  3    7
b  5  3  5  4  3    8
c  3  5  5  5  5    8
d  4  3  4  5  5    7

In [45]:
df.drop('x', axis = 1, inplace = True)

In [46]:
df

   y  z  u  v  new
a  3  5  5  3    7
b  3  5  4  3    8
c  5  5  5  5    8
d  3  4  5  5    7

In [47]:
df1 = pd.DataFrame(np.random.randn(4,5), index = ['a','b','c','d'], columns=['x','y','z','u','v'])

In [48]:
df1[df1<0]

         x         y   z         u         v
a      NaN -0.902698 NaN       NaN -0.164400
b      NaN       NaN NaN       NaN       NaN
c -0.06263 -0.668901 NaN -1.707691 -0.155102
d -0.10146       NaN NaN -0.550530       NaN

In [49]:
df1.values[df1.values<0]

array([-0.90269831, -0.16440044, -0.06263026, -0.66890108, -1.70769116,
       -0.15510182, -0.10146039, -0.55053046])

In [50]:
df1.iloc[0:5]<0

       x      y      z      u      v
a  False   True  False  False   True
b  False  False  False  False  False
c   True   True  False   True   True
d   True  False  False   True  False

In [51]:
df1.values[df1.iloc[0:5]<0]

array([-0.90269831, -0.16440044, -0.06263026, -0.66890108, -1.70769116,
       -0.15510182, -0.10146039, -0.55053046])

In [52]:


for c in df1.columns:
  for v in df1.index:
    if df1.loc[v,c]<0:
      print(c,v,df1.loc[v,c])

x c -0.06263026224640016
x d -0.10146038822521318
y a -0.9026983062685348
y c -0.6689010791540827
u c -1.7076911555764054
u d -0.5505304641168599
v a -0.16440043891797151
v c -0.15510182301578798

In [59]:
d1 = {'key1':[1,2,3,4,np.nan], 'key2':['kunal', 'verma',4,5,6], 'key3':[np.nan, np.nan, np.nan,3,8]}

df1 = pd.DataFrame(d1)

In [60]:
df1

   key1   key2  key3
0   1.0  kunal   NaN
1   2.0  verma   NaN
2   3.0      4   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [62]:
df1.dropna()

   key1 key2  key3
3   4.0    5   3.0

In [63]:
df1.dropna(axis =1)

    key2
0  kunal
1  verma
2      4
3      5
4      6

In [69]:
d2 = {'key1':[1,2,3,4,np.nan], 'key2':['kunal', 'verma',np.nan,5,6], 'key3':[np.nan, np.nan, np.nan,3,8]}

In [70]:
df2 = pd.DataFrame(d2)

In [71]:
df2

   key1   key2  key3
0   1.0  kunal   NaN
1   2.0  verma   NaN
2   3.0    NaN   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [73]:
df2.dropna(axis =1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [74]:
df2.dropna(thresh=0) #Thresh require at least that many not-NA values if not available then drop

   key1   key2  key3
0   1.0  kunal   NaN
1   2.0  verma   NaN
2   3.0    NaN   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [75]:
df2.dropna(thresh=1)

   key1   key2  key3
0   1.0  kunal   NaN
1   2.0  verma   NaN
2   3.0    NaN   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [76]:
df2.dropna(thresh=2)

   key1   key2  key3
0   1.0  kunal   NaN
1   2.0  verma   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [77]:
df2.dropna(thresh = 3)

   key1 key2  key3
3   4.0    5   3.0

In [78]:
df2.dropna(thresh = 4)

Empty DataFrame
Columns: [key1, key2, key3]
Index: []

In [79]:
df2.dropna(axis = 1, thresh = 3)

   key1   key2
0   1.0  kunal
1   2.0  verma
2   3.0    NaN
3   4.0      5
4   NaN      6

In [80]:
df2.fillna('Harhsit')

      key1     key2     key3
0        1    kunal  Harhsit
1        2    verma  Harhsit
2        3  Harhsit  Harhsit
3        4        5        3
4  Harhsit        6        8

In [81]:
df2.fillna(567)

    key1   key2   key3
0    1.0  kunal  567.0
1    2.0  verma  567.0
2    3.0    567  567.0
3    4.0      5    3.0
4  567.0      6    8.0

In [82]:
df2.fillna(value = df['key1'].mean())

   key1   key2  key3
0   1.0  kunal   2.5
1   2.0  verma   2.5
2   3.0    2.5   2.5
3   4.0      5   3.0
4   2.5      6   8.0

In [86]:
d3 = {'name':['kunal', 'harshit', 'karan', 'harshit', 'vishal'],
      'mailid':['vermakunal@gmail.com', 'harshit123@gmal.com', 'karanraj@gmail.com', 'harshit123@gmal.com', 'vishu23@gmail.com' ],
      'salary':[100,200,500,200,500]}

In [87]:
df3 = pd.DataFrame(d3)

In [88]:
df3

      name                mailid  salary
0    kunal  vermakunal@gmail.com     100
1  harshit   harshit123@gmal.com     200
2    karan    karanraj@gmail.com     500
3  harshit   harshit123@gmal.com     200
4   vishal     vishu23@gmail.com     500

In [90]:
df3.groupby('name').mean()

         salary
name
harshit     200
karan       500
kunal       100
vishal      500

In [91]:
df3.groupby('mailid').mean()

                      salary
mailid
harshit123@gmal.com      200
karanraj@gmail.com       500
vermakunal@gmail.com     100
vishu23@gmail.com        500

In [92]:
df3.groupby('mailid').sum()

                      salary
mailid
harshit123@gmal.com      400
karanraj@gmail.com       500
vermakunal@gmail.com     100
vishu23@gmail.com        500

In [93]:
df3.groupby('mailid').describe()

                     salary
                      count   mean  std    min    25%    50%    75%    max
mailid
harshit123@gmal.com     2.0  200.0  0.0  200.0  200.0  200.0  200.0  200.0
karanraj@gmail.com      1.0  500.0  NaN  500.0  500.0  500.0  500.0  500.0
vermakunal@gmail.com    1.0  100.0  NaN  100.0  100.0  100.0  100.0  100.0
vishu23@gmail.com       1.0  500.0  NaN  500.0  500.0  500.0  500.0  500.0

In [94]:
type(df3.groupby('mailid').describe())

pandas.core.frame.DataFrame

In [95]:
df3.groupby('mailid').describe().loc['karanraj@gmail.com']

salary  count      1.0
        mean     500.0
        std        NaN
        min      500.0
        25%      500.0
        50%      500.0
        75%      500.0
        max      500.0
Name: karanraj@gmail.com, dtype: float64

In [96]:
df3.groupby('mailid').describe().iloc[1]

salary  count      1.0
        mean     500.0
        std        NaN
        min      500.0
        25%      500.0
        50%      500.0
        75%      500.0
        max      500.0
Name: karanraj@gmail.com, dtype: float64

In [97]:
type(df3.groupby('mailid').describe().loc['karanraj@gmail.com'])

pandas.core.series.Series

In [98]:
df3.groupby('mailid').describe().loc['karanraj@gmail.com'][1]

500.0

In [100]:
#Alternative way
df3.groupby('mailid').describe().loc['karanraj@gmail.com']['salary']['mean']

500.0

In [101]:
#Column to row and row to column

df3.groupby('mailid').describe().T

mailid        harshit123@gmal.com  ...  vishu23@gmail.com
salary count                  2.0  ...                1.0
       mean                 200.0  ...              500.0
       std                    0.0  ...                NaN
       min                  200.0  ...              500.0
       25%                  200.0  ...              500.0
       50%                  200.0  ...              500.0
       75%                  200.0  ...              500.0
       max                  200.0  ...              500.0

[8 rows x 4 columns]

In [102]:
arr1  = np.random.randn(3,4)

In [103]:
arr2 = np.random.randn(3,4)

In [104]:
arr3 = np.random.randn(3,4)

In [111]:
df1 = pd.DataFrame(arr1, columns = ['A', 'B', 'C', 'D'], index = [0,1,2])
df1

          A        B         C         D
0  1.892030  0.31208 -0.157759 -0.111765
1 -0.911711  0.92162  0.783040  0.439076
2 -0.086652  1.28973  0.565861  0.294904

In [112]:
df2 = pd.DataFrame(arr2, columns = ['A', 'B', 'C', 'D'], index = [0,1,2])
df2

          A         B         C         D
0 -0.847307 -0.733147 -0.370699  0.838933
1 -0.161855 -0.497636 -0.207864  0.323388
2  1.245417 -1.028101  1.077513 -0.757948

In [113]:
df3 = pd.DataFrame(arr3, columns = ['A', 'B', 'C', 'D'], index = [0,1,2])
df3

          A         B         C         D
0  0.204328 -1.233312  0.478411 -0.441945
1 -0.042787  1.043544 -1.612639  0.175711
2  2.438124  0.941213  0.345655 -1.581894

In [117]:
##How to merge the df1, df2, df3
#vertical concat and horizontol concatnate

df4 = pd.concat([df1, df2, df3])

In [120]:
df5 = pd.concat([df1, df2, df3], axis =1)
df5

          A        B         C  ...         B         C         D
0  1.892030  0.31208 -0.157759  ... -1.233312  0.478411 -0.441945
1 -0.911711  0.92162  0.783040  ...  1.043544 -1.612639  0.175711
2 -0.086652  1.28973  0.565861  ...  0.941213  0.345655 -1.581894

[3 rows x 12 columns]

In [119]:
df4

          A         B         C         D
0  1.892030  0.312080 -0.157759 -0.111765
1 -0.911711  0.921620  0.783040  0.439076
2 -0.086652  1.289730  0.565861  0.294904
0 -0.847307 -0.733147 -0.370699  0.838933
1 -0.161855 -0.497636 -0.207864  0.323388
2  1.245417 -1.028101  1.077513 -0.757948
0  0.204328 -1.233312  0.478411 -0.441945
1 -0.042787  1.043544 -1.612639  0.175711
2  2.438124  0.941213  0.345655 -1.581894

In [121]:
#Give me the data which is available at zero index
df4.loc[0]

          A         B         C         D
0  1.892030  0.312080 -0.157759 -0.111765
0 -0.847307 -0.733147 -0.370699  0.838933
0  0.204328 -1.233312  0.478411 -0.441945

In [122]:
df4.iloc[0] #iloc does not go with names indexes like loc.

A    1.892030
B    0.312080
C   -0.157759
D   -0.111765
Name: 0, dtype: float64

In [125]:
df5

          A        B         C  ...         B         C         D
0  1.892030  0.31208 -0.157759  ... -1.233312  0.478411 -0.441945
1 -0.911711  0.92162  0.783040  ...  1.043544 -1.612639  0.175711
2 -0.086652  1.28973  0.565861  ...  0.941213  0.345655 -1.581894

[3 rows x 12 columns]

In [128]:
df5['A']

          A         A         A
0  1.892030 -0.847307  0.204328
1 -0.911711 -0.161855 -0.042787
2 -0.086652  1.245417  2.438124

In [135]:
df5.iloc[:,4]

0   -0.847307
1   -0.161855
2    1.245417
Name: A, dtype: float64

In [147]:
df1 = pd.DataFrame(arr1, columns = ['A', 'B', 'C', 'D'], index = [0,1,2])
df2 = pd.DataFrame(arr2, columns = ['E', 'F', 'G', 'H'], index = [3,4,5])
df3 = pd.DataFrame(arr3, columns = ['I', 'J', 'K', 'L'], index = [6,7,8])

In [151]:
df6 = pd.concat([df1, df2, df3], axis =1)

In [152]:
df6.fillna(0)

          A        B         C  ...         J         K         L
0  1.892030  0.31208 -0.157759  ...  0.000000  0.000000  0.000000
1 -0.911711  0.92162  0.783040  ...  0.000000  0.000000  0.000000
2 -0.086652  1.28973  0.565861  ...  0.000000  0.000000  0.000000
3  0.000000  0.00000  0.000000  ...  0.000000  0.000000  0.000000
4  0.000000  0.00000  0.000000  ...  0.000000  0.000000  0.000000
5  0.000000  0.00000  0.000000  ...  0.000000  0.000000  0.000000
6  0.000000  0.00000  0.000000  ... -1.233312  0.478411 -0.441945
7  0.000000  0.00000  0.000000  ...  1.043544 -1.612639  0.175711
8  0.000000  0.00000  0.000000  ...  0.941213  0.345655 -1.581894

[9 rows x 12 columns]

In [155]:
df11 =  pd.DataFrame(arr1, columns = ['A', 'B', 'C', 'D'], index = [0,1,2])
df11

          A        B         C         D
0  1.892030  0.31208 -0.157759 -0.111765
1 -0.911711  0.92162  0.783040  0.439076
2 -0.086652  1.28973  0.565861  0.294904

In [156]:
df22 =  pd.DataFrame(arr1, columns = ['A', 'B', 'C', 'D'], index = [3,4,5])
df22

          A        B         C         D
3  1.892030  0.31208 -0.157759 -0.111765
4 -0.911711  0.92162  0.783040  0.439076
5 -0.086652  1.28973  0.565861  0.294904

In [157]:
pd.merge(df11, df22, on = "A")

          A      B_x       C_x       D_x      B_y       C_y       D_y
0  1.892030  0.31208 -0.157759 -0.111765  0.31208 -0.157759 -0.111765
1 -0.911711  0.92162  0.783040  0.439076  0.92162  0.783040  0.439076
2 -0.086652  1.28973  0.565861  0.294904  1.28973  0.565861  0.294904

In [158]:
d5 = {'key':['K0', 'K1', 'K2', 'K3'],
      'A':["A0", 'A1', 'A2', 'A3'],
      'B': ["B0", "B1", "B2", "B3"]}

left = pd.DataFrame(d5)

In [164]:
d6 = {'key':['K0', 'K9', 'K2', 'K3'],
      'C':["C0", 'C1', 'C2', 'C3'],
      'D': ["D0", "D1", "D2", "D3"]}

right = pd.DataFrame(d6)

In [165]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [166]:
right

  key   C   D
0  K0  C0  D0
1  K9  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [167]:
pd.merge(left, right, on = "key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [168]:
#Merge is of four types: left, right, outer and inner

pd.merge(left, right, on = "key", how = 'left') #as in the right table there is not K9 available.

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [169]:
pd.merge(left, right, on = "key", how = 'right')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K9  NaN  NaN  C1  D1
2  K2   A2   B2  C2  D2
3  K3   A3   B3  C3  D3

In [170]:
pd.merge(left, right, on = 'key', how = 'outer')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K9  NaN  NaN   C1   D1

In [180]:
d5 = {'key1':['K0', 'K1', 'K2', 'K3'],
      'key2':['K0', 'K1', 'K0', 'K1'],      
      'A':["A0", 'A1', 'A2', 'A3'],
      'B': ["B0", "B1", "B2", "B3"]}
df5 = pd.DataFrame(d5)

In [181]:
d6 = {'key1':['K0', 'K9', 'K2', 'K3'],
      'key2':['K0', 'K0', 'K0', 'K0',],
      'C':["C0", 'C1', 'C2', 'C3'],
      'D': ["D0", "D1", "D2", "D3"]}

df6 = pd.DataFrame(d6)

In [182]:
df5

  key1 key2   A   B
0   K0   K0  A0  B0
1   K1   K1  A1  B1
2   K2   K0  A2  B2
3   K3   K1  A3  B3

In [183]:
df6

  key1 key2   C   D
0   K0   K0  C0  D0
1   K9   K0  C1  D1
2   K2   K0  C2  D2
3   K3   K0  C3  D3

In [184]:
pd.merge(df5, df6, on = ['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K2   K0  A2  B2  C2  D2

In [190]:
df1 = pd.DataFrame({'A':['A0', 'A1', 'A2'],
                    'B':['B0', 'B1', 'B2']},
                    index = ['K0', 'K1', 'K2'])

df2 = pd.DataFrame({'C':['C0', 'C1', 'C2'],
                    'D':['D0', 'D1', 'D2']},
                    index = ['K0', 'K2', 'K3'])

In [191]:
df1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [192]:
df2

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [193]:
df1.join(df2)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [194]:
#Join is of four types : left, right, outer, inner, default is index

#merge: column wise
# join: index wise

df1.join(df2, how = 'right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C1  D1
K3  NaN  NaN  C2  D2

In [ ]:
df1.join(df2, how = 'outer')